In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
%matplotlib inline

# to display the total number columns present in the dataset
pd.set_option('display.max_columns', None)  #if not then will display first and last ones

In [5]:
# let's load the titanic dataset

data = pd.read_csv('titanic.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [12]:
data.shape

(891, 13)

In [6]:
# the total number of missing values

data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
data.isnull().mean()

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

Let's check any relationship between non-survive people and above missing values

In [8]:
data['cabin_null'] = np.where(data.Cabin.isnull(), 1, 0)


data.cabin_null.mean()

0.7710437710437711

In [6]:
data.groupby(['Survived'])['cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: cabin_null, dtype: float64

In [11]:
data.groupby(['Survived'])['cabin_null'].value_counts()

Survived  cabin_null
0         1             481
          0              68
1         1             206
          0             136
Name: cabin_null, dtype: int64

We observe that the percentage of missing values is higher for people who did not survive.

In [13]:
data['age_null'] = np.where(data.Age.isnull(), 1, 0)


data.groupby(['Survived'])['age_null'].mean()

Survived
0    0.227687
1    0.152047
Name: age_null, dtype: float64

In [14]:
data.groupby(['Survived'])['age_null'].value_counts()

Survived  age_null
0         0           424
          1           125
1         0           290
          1            52
Name: age_null, dtype: int64

Again, we observe an increase in missing data for the people who did not survive the tragedy.

In [8]:
data[data.Embarked.isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,cabin_null,age_null
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN,0,0
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN,0,0

In [19]:
data.Embarked.isnull().value_counts()

False    889
True       2
Name: Embarked, dtype: int64

Loan dataset

In [25]:
# let's load the columns of interest from the Lending Club loan book dataset

data=pd.read_csv('loan.csv', usecols=['emp_title','emp_length'])
data.head()

                  emp_title emp_length
0                       NaN  10+ years
1                     Ryder   < 1 year
2                       NaN  10+ years
3       AIR RESOURCES BOARD  10+ years
4  University Medical Group     1 year

In [34]:
# let's check the amount of missing data
data.isnull().mean()

emp_title     0.057988
emp_length    0.000000
dtype: float64

In [36]:
len(data.emp_title.unique())

299273

In [38]:
data.emp_title.value_counts()

Teacher                                     13469
Manager                                     11240
Registered Nurse                             5525
Owner                                        5376
RN                                           5355
Supervisor                                   4983
Sales                                        4212
Project Manager                              3988
Driver                                       3569
Office Manager                               3510
General Manager                              3178
Director                                     3156
manager                                      3138
teacher                                      2925
owner                                        2849
Engineer                                     2671
President                                    2598
driver                                       2429
Vice President                               2351
Attorney                                     2136
Operations Manager                           2071
Accountant                                   2035
Administrative Assistant                     2019
Sales Manager                                1846
Account Manager                              1725
sales                                        1724
Police Officer                               1720
supervisor                                   1675
Executive Assistant                          1603
Analyst                                      1538
                                            ...
Loan Servicer                                   1
Paramount Coal Company                          1
Interium Superintendent                         1
MAIMONIDES MEDICAL CENTER                       1
Secrtary/Treasurer & CFO                        1
Sr. VP of Field Ops                             1
Credit Development Officer                      1
Web Design & Management                         1
Summit truck bodies                             1
Examiner in charge                              1
Rapid City Regional Health                      1
Offset web printer                              1
WolMed Medical PA                               1
Food Server Waitress                            1
Mitchell  and  Associates Law Firm  PLLC        1
von Drehle Corp                                 1
Senior Brand Consultant                         1
HCA North Austin Medical Center                 1
Greenville Hospital system                      1
Cullman Casting                                 1
Ark Media                                       1
Correctional Caseworker                         1
svc director                                    1
enginering tech                                 1
Osborne & Associates                            1
Delivary                                        1
schwebels baking co                             1
Sales Business Development                      1
Paterson Public Schools                         1
LEGAL PARALEGAL                                 1
Name: emp_title, Length: 299272, dtype: int64

Around 6% of the observations contain missing data for employment title.

In [11]:
print('Number of different employer names: {}'.format(len(data.emp_title.unique())))
data.emp_title.unique()[0:20]

Number of different employer names: 299273

array([nan, 'Ryder', 'AIR RESOURCES BOARD', 'University Medical Group',
       'Veolia Transportaton', 'Southern Star Photography',
       'MKC Accounting ', 'Starbucks', 'Southwest Rural metro', 'UCLA',
       'Va. Dept of Conservation/Recreation', 'Target', 'SFMTA',
       'Internal revenue Service', "Chin's Restaurant", 'Duracell',
       'Connection Inspection', 'Network Interpreting Service',
       'Archdiocese of Galveston Houston', 'Osram Sylvania'], dtype=object)

In [12]:
data.emp_length.unique()

array(['10+ years', '< 1 year', '1 year', '3 years', '8 years', '9 years',
       '4 years', '5 years', '6 years', '2 years', '7 years', 'n/a'], dtype=object)

In [14]:
# let's build a dictionary to re-map emp_length to just 3 categories:

length_dict = {k:'0-10 years' for k in data.emp_length.unique()}
length_dict['10+ years']='10+ years'
length_dict['n/a']='n/a'

# let's look at the dictionary
length_dict

{'1 year': '0-10 years',
 '10+ years': '10+ years',
 '2 years': '0-10 years',
 '3 years': '0-10 years',
 '4 years': '0-10 years',
 '5 years': '0-10 years',
 '6 years': '0-10 years',
 '7 years': '0-10 years',
 '8 years': '0-10 years',
 '9 years': '0-10 years',
 '< 1 year': '0-10 years',
 'n/a': 'n/a'}

In [15]:
data['emp_length_redefined'] = data.emp_length.map(length_dict)
data.emp_length_redefined.unique()

array(['10+ years', '0-10 years', 'n/a'], dtype=object)

In [16]:
value = len(data[data.emp_title.isnull()])


data[data.emp_title.isnull()].groupby(['emp_length_redefined'])['emp_length'].count().sort_values() / value

emp_length_redefined
10+ years     0.054006
0-10 years    0.082457
n/a           0.863537
Name: emp_length, dtype: float64